Revit 2027 API
EffectInstance.SetSpecularColor Method
 Sets the specular color parameter of the effect instance.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSpecularColor(
	Color color
)
Public Sub SetSpecularColor (
	color As Color
)
public:
void SetSpecularColor(
	Color^ color
)
member SetSpecularColor :
        color : Color -> unit
Parameters
color Color
 The specular color value.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EffectInstance Class
Autodesk.Revit.DB.DirectContext3D Namespace